Revit 2027 API
ExportLayerInfo.GetLayerModifiers Method
 Gets all the project layer modifiers from the layer info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<LayerModifier> GetLayerModifiers()
Public Function GetLayerModifiers As IList(Of LayerModifier)
public:
IList<LayerModifier^>^ GetLayerModifiers()
member GetLayerModifiers : unit -> IList<LayerModifier>
Return Value
IList<LayerModifier>
 The project layer modifier array.
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace